[
  {
    "id": "steak-dinner",
    "title": "Garlic Butter Steak",
    "image": "images/steak.jpg",
    "cuisine": "british",
    "protein": "steak",
    "meal": "dinner",
    "carb": "potato",
    "description": "Juicy pan-seared steak with garlic butter.",
    "prepTime": "10 min",
    "cookTime": "8 min",
    "totalTime": "18 min",
    "servings": 2,
    "ingredients": [
      "2 ribeye steaks",
      "Salt and pepper",
      "2 tbsp butter",
      "2 cloves garlic"
    ],
    "steps": [
      "Season steaks generously with salt and pepper.",
      "Heat a pan over high heat.",
      "Sear steaks 3–4 minutes per side.",
      "Add butter and garlic, baste steaks.",
      "Rest before serving."
    ]
  },
    {
    "id": "salmon-crispy-potato-dinner",
    "title": "Salmon with Crispy Potatoes and Avocado Crema",
    "image": "images/salmon-avo.png",
    "cuisine": "british",
    "protein": "fish",
    "meal": "dinner",
    "carb": "potato",
    "description": "",
    "totalTime": "1 hour",
    "ingredients": [
      "salmon",
      "potatoes",
      "lettuce",
      "cucumber",
      "red onion",
      "avocado",
      "coriander",
      "lime",
      "jalepenos",
      "yoghurt/creme fraiche"
    ],
    "steps": [
      ""
    ]
  },
   {
    "id": "spring-caesar-dinner",
    "title": "Spring Chicken Caesar Salad",
    "image": "images/spring-chicken-caesar.jpg",
    "cuisine": "british",
    "protein": "chicken",
    "meal": "dinner",
    "carb": "bread",
    "description": "Literally the most delicious salad to have ever graced your table",
    "prepTime": "",
    "cookTime": "",
    "totalTime": "",
    "servings":"",
    "ingredients": [
      ""
    ],
    "steps": [
      ""
    ]
  },
    {
    "id": "dahl-dinner",
    "title": "Daily Dahl",
    "image": "images/dahl.jpg",
    "cuisine": "indian",
    "meal": "dinner",
    "carb": "grains and pulses",
    "description": "Classic dahl make with speedy raita, pickled onions and a garlic naan.",
    "totalTime": "40 min",
    "servings": 4,
    "ingredients": [
      "225g red lentils",
      "2 tbsp rapeseed oil",
      "optional: 12 peppercorns",
      "optional: 4 cloves",
      "1 onion, thinly sliced",
      "4 cloves of garlic, crushed",
      "6cm ginger, peeled and finely grated",
      "1/2 tsp chilli powder",
      "1/2 tsp ground coriander",
      "1/2 tsp ground turmeric",
      "1 tsp salt",
      "300g tinned plum tomatoes"
    ],
    "steps": [
      "In a sieve, rinse the lentils until the water runs clear, then drain and put into a deep, lidded saucepan.",
      "Add 600ml cold water, bring to the boil over a medium to high heat, then cover with the lid and simmer gently for 10-15 mins without stirring, until thoroughly cooked.",
      "Meanwhile, put thew oil into another deep, lidded saucepan on a medium heat. When it's hot, add the peppercorns and cloves and stir fry for ~1 min until you can smell them. Then add the onion and cook for 8-10 mins until golden.",
      "Add the garlic and ginger and stir-fry for a further 4 mins before adding the chilli powder, coriander, turmeric, and salt.",
      "Stir well, then add the tinned tomatoes. If they're whole, pour them out with one hand and crush them with your other hand to break them up before they hit the pan. Cover, turn the heat down and simmer for ~8 mins.",
      "The tomatoes should be looking darker and more paste-like now, with little tomato juice running from them. Add the lentils using a straining spoon, then pour in any remaining water they were boiling in, a little at a time, until you get a good consistency.",
      "Finally, cover the pan with the lid again and cook on a low heat for a further 10 mins.",
      "Taste and adjust the seasoning as you like. Serve with chapatis, yoghurt, pickled onions and some coriander."
    ]
  },
    {
    "id": "halloumi-lunch",
    "title": "Izzie Rugina Bulgar Wheat Halloumi Special",
    "image": "images/iz-halloumi.jpg",
    "protein": "halloumi",
    "meal": "lunch",
    "carb": "grains",
    "totalTime": "1 hour",
    "ingredients": [
      "red onion",
      "peppers",
      "courgette",
      "halloumi",
      "bulgar wheat",
      "sprouts",
      "paprika",
      "cumin",
      "salt & pepper",
      "tahini",
      "lemon",
      "olive oil"
    ],
    "steps": [
      "Chop red onion, peppers, courgette and put in a roasting tray a coat with a decent amount of cumin, paprika, salt and pepper.",
      "Roast in oven for 25 mins before adding the halloumi and cooking until well roasted.",
      "Cook sprouts on same or separate tray with seasonings until crispy.",
      "Cook bulgar wheat.",
      "Optional tahini dressing with tahini, lemon, salt, pepper, olive oil, and water."
    ]
  },
   {
    "id": "turkish-eggs",
    "title": "Turkish Eggs",
    "image": "images/turkish-eggs.jpg",
    "protein": "eggs",
    "meal": "breakfast",
    "carb": "bread",
    "totalTime": "10 min"
  },
    {
    "id": "sausage-dinner",
    "title": "Sausage, Sweet Potato & Bean Casserole",
    "image": "images/Sausage-Sweet-Potato-Beans.jpg",
    "cuisine": "british",
    "protein": "sausages",
    "meal": "dinner",
    "carb": "potato",
    "description": "A lovely one-pot winter warmer of sausages, sweet potato and beans finished with a gremolata to keep things fresh. Perfect for a cold weeknight dinner.",
    "prepTime": "10 min",
    "cookTime": "15 min",
    "totalTime": "25 min",
    "servings": 4,
    "ingredients": [
      "2 sweet potatoes",
      "8 sausages",
      "1 onion",
      "2 garlic cloves",
      "2 tbsp tomato puree",
      "sprig of rosemary",
      "240g cannellini beans",
      "250ml water",
      "15g parsley",
      "1 lemon",
      "olive oil"
    ],
    "steps": [
      "Peel and dice the sweet potato into roughly 3cm cubes.",
      "Place a large pan over a medium heat and add a drizzle of olive oil. Add the sausages and potatoes and cook for 5 mins until well coloured.",
      "Reduce the heat to low, finely slice the onions and garlic and add along with the tomato puree and rosemary. Cook for another few mins until the onion softens.",
      "Pour in the beans and the water. Pop a lid on the pan and cook for about 10 mins until the potatoes have softened.",
      "Peel a few strips of the lemon zest using a vegetable peeler. Finely mince the lemon zest and the parsley and mix together to make a gremolata.",
      "Plate up with sausages and beans and sprinkle over the gremolata and a drizzle of olive oil. Finish with a squeeze of the lemon juice."
    ]
  },
    {
    "id": "chicken-meatball-dinner",
    "title": "Emily English Chicken Tarragon Ricotta Meatball Al Forno",
    "image": "images/chicken-meatballs.jpg",
    "protein": "chicken",
    "meal": "dinner",
    "carb": "pasta",
    "totalTime": "30 min",
    "servings": 4,
    "ingredients": [
      "500g 5% fat chicken mince (or any lean mince you like)",
      "1 small courgette, grated",
      "1 heaped tbsp sundried tomatoes, finely chopped",
      "40g wholegrain breadcrumbs",
      "1 small red onion",
      "1 garlic clove, finely minced",
      "1 tbsp fresh tarragon, chopped",
      "2 tbsp ricotta",
      "zest of 1/2 lemon",
      "salt & pepper",
      "For the orzo: 200g orzo",
      "1 x 400g tin high-quality cherry tomatoes",
      "1 chicken stock cube",
      "pinch of chilli flakes",
      "1 clove garlic, minced",
      "2 big handfuls of kale, roughly torn",
      "extra ricotta and parmesan to serve"
    ],
    "steps": [
      "Blitz the onion and garlic together in a food processor until finely chopped. Add the courgette and sundried tomatoes and pulse again, or grate if preferred.",
      "In a large bowl, mix the chicken mince, processed vegetables, breadcrumbs, tarragon, ricotta, lemon zest, salt and pepper. Shape into small balls with wet hands and chill in the fridge for 10-15 minutes to firm up.",
      "Heat a large non-stick frying pan with a little olive oil and brown the meatballs on all sides - they dont need to be cooked through at this stage - then remove them to a plate.",
      "To the same pan add the minced garlic and chilli flakes, cook for 30 seconds, add a splash of water to deglaze, then stir in the orzo. Add the tin of cherry tomatoes, crumble in the stock cube, and add 400ml water.",
      "Simmer gently, stirring often to prevent sticking, until the orzo is al dente (10-12 mins). Add a splash more water if needed if it's getting too dry.",
      "Stir the kale through the orzo to wilt, press the browned meatballs back into the orzo, top with a few dollops of ricotta and a generous grating of parmesan, then place under a hot grill for 5 mins until golden and bubbling and the meatballs are cooked through."
    ]
  },
  {
    "id": "dense-bean-salad",
    "title": "Grilled Chipotle Chicken and Corn Dense Bean Salad",
    "image": "images/dense-bean-salad.jpg",
    "cuisine": "mexican",
    "protein": "chicken",
    "meal": "lunch",
    "carb": "beans",
    "description": "Charred chicken and corn, spicy vinaigrette, and crunchy vegetables.",
    "prepTime": "20 min",
    "cookTime": "15 min",
    "totalTime": "35 min",
    "servings": 6,
    "ingredients": [
      "Chicken Marinade: 0.5kg chicken thighs",
      "1 7oz can chipotle peppers in adobo",
      "2 limes, juiced",
      "big pinch salt",
      "1/4 cup olive oil",
      "1/4 cup water",
      "5 cloves garlic",
      "For the Salad: 3 ears of corn",
      "2 tbsp oil",
      "2 bell peppers",
      "1 bunch coriander",
      "1 small red onion",
      "1 can butter beans",
      "1 can chickpeas",
      "1 pint cherry tomatoes",
      "2 avocados",
      "For the Dressing: 1/2 cup oil",
      "2 limes, juiced",
      "1/4 cup rice vinegar",
      "2 tsp chipotle powder",
      "1 tsp cumin",
      "2 garlic cloves, crushed",
      "2 tbsp mayonnaise"
    ],
    "steps": [
      "Add the peppers, lime juice, oil, water, salt, and garlic to a blender and blend until creamy and bright orange.",
      "Use a fork to poke some holes in the chicken so the marinade can penetrate better and pour the marinade over it.",
      "Cover and let marinate in the fridge for at least and hour but up to overnight.",
      "Grill chicken and corn and allow to chill.",
      "Add diced bell peppers, minced coriander and minced red onion to a large bowl.",
      "rinse and drain butter beans and chickpeas and add them to the bowl.",
      "Add sliced cherry tomatoes, cubed avocado, chopped, cooled chicken, and corn to the bowl.",
      "Mix the oil, lime juice, vinegar, chipotle powder, cumin, salt, and mayonnaise in a jar (can use a milk frother to make it creamy).",
      "Pour the dressing over the salad and toss everything together.",
      "Can add jalepenos/cheese is desired"
    ]
  },
    {
    "id": "seedy-breakfast",
    "title": "Seedy Breakfast",
    "image": "images/seedy-breakfast.PNG",
    "meal": "breakfast",
    "description": "",
    "totalTime": "15 min",
    "ingredients": [
      ""
    ],
    "steps": [
      ""
    ]
  },
    {
    "id": "tikka-masala-dinner",
    "title": "Sheet-Pan Tikka Masala",
    "image": "images/tikka-masala.jpg",
    "cuisine": "indian",
    "protein": "chicken",
    "meal": "dinner",
    "carb": "potato",
    "description": "",
    "prepTime": "10 min",
    "cookTime": "55 min",
    "totalTime": "1 hour 5 mins",
    "servings": 4,
    "ingredients": [
      "1 medium red onion, very thinly sliced",
      "1/4 cup lime juice",
      "1 cup whole-milk yoghurt",
      "1 tbsp sweet paprika",
      "1 tsp garam masala",
      "1 tsp ground tumeric",
      "1.5kg bone-in, skin-on chicken thighs/drumsticks",
      "700g baby yellow potatoes, halved, quartered if larger",
      "2 tbsp vegetable oil for potatoes plus extra for cooking",
      "1/2 small yellow onion, finely chopped",
      "1/2 serrano chile, seeded, finely chopped, plus more for serving",
      "1 (2 inch) piece ginger, peeled, grated",
      "3 cloves garlic, grated",
      "2 tbsp tomato paste",
      "1 tsp garam masala",
      "1 tsp ground turmeric",
      "1 can crushed tomatoes",
      "1/2 cup heavy cream",
      "salt & pepper",
      "Chopped fresh cilantro, for serving"
    ],
    "steps": [
      "Pickled Onions: In a medium bowl, toss onion, lime juice, and a few large pinches of salt until combined. Let sit until ready to use.",
      "Chicken & Potatoes: Preheat oven to 425°. In a large bowl, combine yogurt, paprika, garam masala, turmeric, and 1 tablespoon salt. Add chicken and toss to coat. Let marinate at room temperature at least 15 minutes, or cover and refrigerate up to 2 hours.",
      "Meanwhile, on a large baking sheet, toss potatoes with oil; season with salt and pepper. Roast 10 minutes.",
      "Carefully nestle chicken onto baking sheet. Continue to roast, tossing potatoes halfway through, until chicken is golden brown and cooked through and potatoes are tender and crisp, 35 to 45 minutes.",
      "Sauce & Assembly: In a medium saucepan over medium-high heat, heat oil. Cook onion, stirring occasionally, until softened, about 7 minutes. Add chile, ginger, and garlic and cook, stirring occasionally, until softened and fragrant, about 1 minute. Stir in tomato paste, garam masala, and turmeric and cook, stirring constantly, until fragrant, about 1 minute more.",
      "Stir in tomatoes and bring to a simmer. Reduce heat to medium-low and cook, stirring occasionally, until thickened, about 10 minutes. Remove from heat and stir in cream; season with salt and pepper.",
      "Using an immersion blender, blend sauce until smooth (or transfer sauce to a standard blender and blend until smooth), about 1 minute. Keep sauce warm.",
      "Spoon some sauce over chicken right out of the oven. Top with pickled onions, chiles, and cilantro. Serve with remaining sauce alongside."
    ]
  },
    {
    "id": "meatballs-beans-dinner",
    "title": "Sausage meatballs, Leek, & Butterbeans with Romesco",
    "image": "images/meatballs2.png",
    "cuisine": "british",
    "protein": "sausages",
    "meal": "dinner",
    "carb": "beans",
    "description": "One-pan roasted meatballs, leeks and tomatoes on a bed of romesco.",
    "prepTime": "10 min",
    "cookTime": "30 min",
    "totalTime": "40 min",
    "servings": "2-4",
    "ingredients": [
      "2 large leeks",
      "800g Lincolnshire sausage",
      "350g plum tomatoes",
      "400g butter beans",
      "20g flat leaf parsley",
      "2 tsp oregano",
      "olive oil",
      "salt & pepper",
      "4 red peppers",
      "juice of 1 lemon",
      "3 garlic cloves",
      "50g sun-dried tomatoes",
      "100g almonds",
      "15g flat leaf parsley",
      "1/4 cup extra virgin olive oil",
      "1 tsp smoked paprika",
      "2 tsp red wine vinegar",
      "1 tsp salt",
      "1 tsp chilli flakes"
    ],
    "steps": [
      "Roast the peppers at 200°C until blackened and peel.",
      "Chop the flat-leaf parsley.",
      "Slice the leeks into 2cm thick circles. Form equally-sized balls with the sausage meat. Add a splash of oil to a deep oven tray and add the leeks, sausage, tomatoes and oregano with a touch of seasoning.",
      "Decant all the ingredients for the romesco sauce into a food processor and blitz until moderately smooth. A few almond chunks are fine and welcome. If you can, let marinade in the fridge for ~30 minutes.",
      "Put the tray with leeks, sausage, and tomatoes into the oven at 200°C. Cook for ~10 minutes, turning the sausage.",
      "Add the butter beans, and a sprinkling of parsley, and give the tray a good shake. Back into the oven for ~15 minutes. If you haven’t browned the meat previously, sticking the tray on the top shelf for 5-10 minutes with occasionally turning can help. Once the meat is cooking, the tomatoes bursting open, and the leeks are soft, it’s ready for serving.",
      "To serve, lay down a thick base of Romesco sauce, add tomatoes, leeks, and butter beans, and top with sausage and parsley. A garnish of lemon wedges or zest is a welcome addition."
    ]
  },
   {
    "id": "bagel-breakfast",
    "title": "Breakfast Bagel",
    "image": "images/bagel.PNG",
    "cuisine": "british",
    "meal": "breakfast",
    "carb": "bread",
    "description": "Bagel with jalapeno garlic chive cream cheese, avo, egg and sriracha.",
    "totalTime": "10 min",
    "ingredients": [
      ""
    ],
    "steps": [
      ""
    ]
  },
     {
    "id": "banana-breakfast-bowl",
    "title": "Banana Breakfast Bowl",
    "image": "images/breakfast-bowl.PNG",
    "meal": "breakfast",
    "description": "Breakfast bowl with banana, coconut flakes, peanut butter and granola.",
    "totalTime": "10 min",
    "ingredients": [
      ""
    ],
    "steps": [
      ""
    ]
  },
    {
    "id": "desserts",
    "title": "Chocolate Guinness Cake",
    "image": "images/Chocolate-Guinness-Cake.jpg",
    "meal": "desserts",
    "description": "",
    "prepTime": "20 min",
    "cookTime": "1 hour",
    "totalTime": "1 hour 20 mins",
    "servings": "10-12",
    "ingredients": [
      "250ml (one cup) Guinness",
      "250g butter",
      "75g cocoa powder",
      "400g caster sugar",
      "150ml full fat sour cream",
      "2 large eggs (not fridge cold)",
      "1 tablespoon vanilla extract",
      "275g plain flour",
      "2 1/2 teaspoons bicarbonate of soda",
      "2 teaspoons instant espresso powder (optional)",

      "300g full fat cream cheese",
      "150g icing sugar",
      "1 teaspoon vanilla extract",
      "125ml double cream"
    ],
    "steps": [
      "Preheat the oven to 180°C. Grease and line a 23cm (9 inch) springform cake tin.",
      "Pour the Guinness into a large, wide saucepan and add the butter. Melt slowly over a low heat, stirring occasionally.",
      "As soon as the butter has melted, whisk in the cocoa powder and caster sugar.",
      "In a medium jug or bowl, beat the sour cream, eggs and vanilla extract together. Pour this mixture into the pan of Guinness and melted butter and whisk well.",
      "Sieve together the flour, bicarbonate of soda and instant espress powder, if using. Whisk the dry ingredients into the pan of wet ingredients. As soon as you have a smooth batter and no pockets of flour remain, stop whisking.",
      "Pour the cake batter into the lined tin and bake for 45-60 minutes or until the cake has risen and a skewer inserted in the middle of the cake emerges with no wet batter",
      "Place the cake tin on a wire cooling rack and let it cool completely in the tin.",
      "To make the frosting, lightly whip the cream cheese until smooth, then sieve in half of the icing sugar. Beat until smooth, then add the remaining icing sugar and beat until smooth. Pour in the vanilla extract and double cream and beat until you have a light, smooth frosting.",
      "To assemble the cake, carefully remove it from the tin and peel off the baking paper. Set the cake on a serving plate, then top with the cream cheese frosting, swirling the top with a small palette knife to make it look like the top of a pint of Guinness."
    ]
  },
    {
    "id": "cookies-of-dreams",
    "title": "Dad's cookies of dreams",
    "image": "images/cookies.jpg",
    "meal": "desserts",
    "totalTime": "2 hours",
    "servings": 14,
    "ingredients": [
      "230g cold butter",
      "100g caster sugar",
      "160g soft light brown sugar",
      "200g caramelised white chocolate; chopped. https://youtu.be/9AH0GT-ollk (needs white choc with high fat content (30%+)). One min in microwave. Stir. 15 secs. Stir. Repeat until thickened and colour is caramelised. Approx. 2.5 – 3 min cooking time in total. Pour into greaseproof paper lined mould to set.",
      "300g white chocolate chips",
      "400g plain flour",
      "100g self raising flour",
      "1 tsp salt",
      "2 tsp baking powder",
      "2 whole eggs",
      "1 egg yolk",
      "1/2 tsp Vanilla Extract"
    ],
    "steps": [
      "Add ingredients in order. Mixing together between additions but not creaming. Make a dough lump.",
      "Make 14 x 125g balls. Don't over-work.",
      "Freeze them for 90 mins to overnight.",
      "Cook at 180°C fan for 14 mins. Make sure preheated baking stone in place to crisp bottoms. If not golden, cook 1 min more."
    ]
  },
    {
    "id": "chicken-greek-dinner",
    "title": "One-pan Lemon Garlic Chicken and Potatoes",
    "image": "images/steak.jpg",
    "cuisine": "greek",
    "protein": "chicken",
    "meal": "dinner",
    "carb": "potato",
    "description": "",
    "prepTime": "15 min",
    "cookTime": "1 hour",
    "totalTime": "1 hour 15 mins",
    "servings": 6,
    "ingredients": [
      "1/2 cup (125 ml) olive oil",
      "1 tbsp dried oregano",
      "1 tbsp freshly minced garlic" ,
      "Zest of 1 lemon, plus the juice of 2 lemons (you need ¼ cup/60 ml of lemon juice)",
      "1 tbsp sweet paprika",
      "1 tsp dijon mustard",
      "1 tsp sugar",
      "1½ tsp sea salt flakes",
      "½ tsp freshly cracked black pepper",
      "1.2 kg bone-in, skin-on chicken thighs",
      "6 medium all-purpose potatoes, cut into wedges",
      "½ cup (125 ml) chicken stock",
      "1 lemon, sliced",
      "1 jar olives",
      "1 tbsp fresh oregano or parsley, to garnish",  
      "Steamed greens or green salad, to serve"
    ],
    "steps": [
      "Preheat the oven to 200°C.",
      "In a large bowl, combine the olive oil, oregano, garlic, lemon zest and juice, sweet paprika, dijon mustard, sugar, salt and pepper. Add the chicken and toss to coat. Marinate for up to 24 hours or cook immediately.",
      "Arrange the potatoes in an even layer in a large baking pan and top with the chicken. Scrape out any marinade left in the bowl and coat the potatoes with it, using your hands. Ensure the chicken cutlets are not overlapping",
      "Add the chicken stock to the base of the pan.",
      "Scatter the lemon slices around the pan on top of the potatoes only (avoid placing the lemon slices on the chicken as it stops the skin from browning).",
      "Bake for 55–60 minutes or until the chicken is golden and cooked through, shuffling the potatoes to stop them burning and adding the olives at around the 30-minute mark.",
      "Sprinkle the chicken with fresh oregano or parsley and serve with your side of choice."
    ]
  },
    {
    "id": "flatbread-staples",
    "title": "Quick flatbreads",
    "image": "images/flatbread.jpg",
    "meal": "staples",
    "carb": "bread",
    "description": "Whip up these speedy flatbreads for an Indian-style feast. They’re like a cheat’s version of naan bread, and are great for mopping up a curry.",
    "prepTime": "15 min",
    "cookTime": "5 min",
    "totalTime": "20 min",
    "servings": 8,
    "ingredients": [
      "300g self-raising flour",
      "1/2 tsp baking powder",
      "150g natural yogurt",
      "1 tbsp vegetable oil",
      "melted ghee or butter, for brushing",
      "cumin seeds, chopped garlic cloves, chopped coriander or chopped chillies (optional)"
    ],
    "steps": [
      "Combine the flour, baking powder, yogurt and oil with 1 tsp salt and 2 tbsp water, and bring together into a rough dough. Tip onto a lightly floured surface and knead for a few minutes until slightly smooth, then divide into four to eight pieces, depending on the size of flatbread you want.",
      "Heat a heavy-based frying pan over a high heat. To make basic flatbreads, roll the dough pieces out on a lightly floured surface into rough ovals, then fry for 1-2 mins on each side until golden and slightly charred in spots. Alternatively, roll the dough pieces out, brush with a little melted ghee or butter, and scatter over the cumin seeds, garlic, coriander or chillies, if you like. Fold each piece of dough over on itself, then roll out again into a rough oval and cook in the same way.",
      "Sear steaks 3–4 minutes per side.",
      "Brush the flatbreads with a little melted butter or ghee, then serve."
    ]
  }
]
